{"_id":{"$oid":"663bd9db87690ab53c193f41"},"title":"Paprika","summary":"When a machine that allows therapists to enter their patients' dreams is stolen, all hell breaks loose. Only a young female therapist, Paprika, alongside her virtual dream avatar, can stop it.","director":{"name":"Satoshi Kon","bio":"Satoshi Kon was a Japanese film director, animator, screenwriter and manga artist from Sapporo, Hokkaido, and a member of the Japanese Animation Creators Association.","birth":"1963-10-12","death":"2010-08-24"},"year":2006,"genre":{"name":"Sci-fi","definition":"Science fiction (sci-fi) is a genre of fiction that incorporates real or imagined science and technology into its plot, setting, or theme. It's often futuristic and speculative, and sometimes called \"speculative fiction\". Science fiction stories envision alternative worlds with consistent rules and structures, set apart from the ordinary world of our time and place."},"imagePath":"paprikaposter.jpeg","featured":true}
{"_id":{"$oid":"663be45b87690ab53c193f42"},"title":"Nausicaa","summary":"In a post-apocalyptic world, Princess Nausicaa of the Valley of the Wind must navigate political intrigue and environmental challenges to save her people from destruction.","director":{"name":"Hayao Miyazaki","bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and co-founder of Studio Ghibli, known for his imaginative and emotionally resonant storytelling.","birth":"1941-01-05"},"year":1984,"genre":{"name":"Fantasy/Adventure","definition":"Fantasy/Adventure combines elements of fantastical worlds and adventurous quests, often featuring heroes on epic journeys in imaginative settings."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be4a687690ab53c193f43"},"title":"Only Yesterday","summary":"A young woman reflects on her childhood while taking a trip to the countryside, leading her to confront unresolved feelings and memories.","director":{"name":"Isao Takahata","bio":"Isao Takahata was a Japanese film director, screenwriter, and producer, known for his work with Studio Ghibli and his poignant storytelling style.","birth":"1935-10-29","death":"2018-04-05"},"year":1991,"genre":{"name":"Drama/Romance","definition":"Drama/Romance explores human emotions and relationships, often focusing on personal growth, love, and self-discovery."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be4c487690ab53c193f44"},"title":"Tekkonkinkreet","summary":"In the crime-infested Treasure Town, two street kids, Black and White, fight to protect their home from yakuza and other threats, all while dealing with their troubled pasts.","director":{"name":"Michael Arias","bio":"Michael Arias is a filmmaker and animator known for his work on Tekkonkinkreet and his contributions to the anime industry.","birth":null},"year":2006,"genre":{"name":"Action","definition":"Action/Crime films feature fast-paced action sequences and suspenseful plots centered around criminal activities, investigations, or conflicts."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be4e287690ab53c193f45"},"title":"Akira","summary":"In a cyberpunk dystopian future, a teenage biker gang member, Tetsuo, gains incredible psychic powers, triggering chaos and government conspiracies.","director":{"name":"Katsuhiro Otomo","bio":"Katsuhiro Otomo is a Japanese manga artist, screenwriter, and film director, best known for creating Akira and pioneering cyberpunk storytelling in anime and manga.","birth":"1954-04-14"},"year":1988,"genre":{"name":"Fantasy","definition":"Cyberpunk/Sci-fi blends futuristic technology, societal decay, and elements of noir, exploring themes of identity, power, and the impact of technology on society."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be55b87690ab53c193f46"},"title":"The Thief and The Cobbler","summary":"A humble cobbler and a mischievous thief embark on a quest to save the Golden City from an evil sorcerer who seeks to marry its princess and conquer the kingdom.","director":{"name":"Richard Williams","bio":"Richard Williams was a Canadian-British animator, known for his groundbreaking work in animation, including The Thief and The Cobbler and his contributions to the industry.","birth":"1933-03-19","death":"2019-08-16"},"year":1993,"genre":{"name":"Animation/Fantasy","definition":"Animation/Fantasy combines imaginative storytelling with visually stunning animation, often featuring fantastical worlds and magical adventures."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be57687690ab53c193f47"},"title":"Atlantis: The Lost Empire","summary":"A young linguist joins a team of explorers on a journey to find the lost city of Atlantis, encountering ancient mysteries and dangerous adversaries along the way.","director":{"name":"Gary Trousdale, Kirk Wise","bio":"Gary Trousdale and Kirk Wise are American film directors and animators, known for their work on various Disney animated films, including Beauty and the Beast and The Hunchback of Notre Dame."},"year":2001,"genre":{"name":"Animation/Adventure","definition":"Animation/Adventure features exciting quests and perilous journeys, often set in fantastical or historical worlds, and aimed at entertaining audiences of all ages."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be59587690ab53c193f48"},"title":"Ghost in the Shell","summary":"In a cybernetic future, a cyborg policewoman, Major Motoko Kusanagi, hunts a mysterious hacker known as the Puppet Master, leading her to question her own identity and humanity.","director":{"name":"Mamoru Oshii","bio":"Mamoru Oshii is a Japanese filmmaker and screenwriter, known for his contributions to anime and his philosophical approach to storytelling.","birth":"1951-08-08"},"year":1995,"genre":{"name":"Cyberpunk/Sci-fi","definition":"Cyberpunk/Sci-fi blends futuristic technology, societal decay, and elements of noir, exploring themes of identity, power, and the impact of technology on society."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be5c587690ab53c193f49"},"title":"Prince of Egypt","summary":"The biblical tale of Moses, from his birth to leading the Israelites out of Egypt, is brought to life in this animated epic filled with stunning visuals and powerful music.","director":{"name":"Brenda Chapman, Steve Hickner, Simon Wells","bio":"Brenda Chapman, Steve Hickner, and Simon Wells are American filmmakers and animators, known for their work on various animated films, including The Lion King and The Prince of Egypt."},"year":1998,"genre":{"name":"Animation/Drama","definition":"Animation/Drama explores profound themes and emotional storytelling, often adapting classic tales or historical events into visually captivating animated films."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be5dc87690ab53c193f4a"},"title":"Wizards","summary":"In a post-apocalyptic world where magic has returned, two wizard brothers, Avatar and Blackwolf, battle for control over humanity's fate, leading to an epic confrontation between good and evil.","director":{"name":"Ralph Bakshi","bio":"Ralph Bakshi is an American animator and filmmaker, known for his innovative use of animation techniques and his provocative storytelling style.","birth":"1938-10-29"},"year":1977,"genre":{"name":"Animation/Fantasy","definition":"Animation/Fantasy combines imaginative storytelling with visually stunning animation, often featuring fantastical worlds and magical adventures."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be68887690ab53c193f4b"},"title":"Perfect Blue","summary":"A young pop singer's transition from a music idol to an actress takes a dark turn as she is stalked by an obsessed fan, blurring the lines between reality and hallucination.","director":{"name":"Satoshi Kon","bio":"Satoshi Kon was a Japanese film director, animator, screenwriter, and manga artist, known for his psychological thrillers and innovative storytelling techniques.","birth":"1963-10-12","death":"2010-08-24"},"year":1997,"genre":{"name":"Psychological/Thriller","definition":"Psychological/Thriller films create tension and suspense through psychological manipulation and complex narratives, often exploring themes of identity, perception, and reality."},"imagePath":null,"featured":false}
{"_id":{"$oid":"663be6ab87690ab53c193f4c"},"title":"My Neighbor Totoro","summary":"Two young sisters, Satsuki and Mei, move to the countryside with their father and encounter friendly forest spirits, including the enigmatic Totoro, in this heartwarming tale of magic and friendship.","director":{"name":"Hayao Miyazaki","bio":"Hayao Miyazaki is a Japanese animator, filmmaker, and co-founder of Studio Ghibli, known for his imaginative and emotionally resonant storytelling.","birth":"1941-01-05"},"year":1988,"genre":{"name":"Fantasy","definition":"Fantasy/Family films transport audiences to magical worlds and heartwarming adventures, often emphasizing themes of friendship, courage, and the wonder of childhood."},"imagePath":null,"featured":false}
